; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem depot-3-3-3-6-6-5) (:domain depots)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 truck2 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 - Pallet
	crate0 crate1 crate2 crate3 crate4 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 - Hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear crate3)
	(at pallet3 distributor0)
	(clear crate4)
	(at pallet4 distributor1)
	(clear pallet4)
	(at pallet5 distributor2)
	(clear crate2)
	(at truck0 distributor2)
	(at truck1 distributor0)
	(at truck2 depot1)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at crate0 distributor2)
	(on crate0 pallet5)
	(at crate1 distributor2)
	(on crate1 crate0)
	(at crate2 distributor2)
	(on crate2 crate1)
	(at crate3 depot2)
	(on crate3 pallet2)
	(at crate4 distributor0)
	(on crate4 pallet3)
)

(:goal (and
		(on crate0 crate4)
		(on crate1 pallet1)
		(on crate3 pallet3)
		(on crate4 crate3)
	)
))

; plan
1. (lift hoist5 crate2 crate1 distributor2)
   deleted: (at crate2 distributor2) (available hoist5) (on crate2 crate1) (clear crate2)
   added: (lifting hoist5 crate2) (clear crate1)
   goals met: 0 of 4
2. (load hoist5 crate2 truck0 distributor2)
   deleted: (lifting hoist5 crate2)
   added: (in crate2 truck0) (available hoist5)
   goals met: 0 of 4
3. (lift hoist5 crate1 crate0 distributor2)
   deleted: (at crate1 distributor2) (available hoist5) (on crate1 crate0) (clear crate1)
   added: (lifting hoist5 crate1) (clear crate0)
   goals met: 0 of 4
4. (load hoist5 crate1 truck0 distributor2)
   deleted: (lifting hoist5 crate1)
   added: (in crate1 truck0) (available hoist5)
   goals met: 0 of 4
5. (lift hoist5 crate0 pallet5 distributor2)
   deleted: (at crate0 distributor2) (available hoist5) (on crate0 pallet5) (clear crate0)
   added: (lifting hoist5 crate0) (clear pallet5)
   goals met: 0 of 4
6. (load hoist5 crate0 truck0 distributor2)
   deleted: (lifting hoist5 crate0)
   added: (in crate0 truck0) (available hoist5)
   goals met: 0 of 4
7. (lift hoist2 crate3 pallet2 depot2)
   deleted: (at crate3 depot2) (available hoist2) (on crate3 pallet2) (clear crate3)
   added: (lifting hoist2 crate3) (clear pallet2)
   goals met: 0 of 4
8. (drive truck0 distributor2 depot2)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot2)
   goals met: 0 of 4
9. (load hoist2 crate3 truck0 depot2)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck0) (available hoist2)
   goals met: 0 of 4
10. (drive truck0 depot2 depot1)
   deleted: (at truck0 depot2)
   added: (at truck0 depot1)
   goals met: 0 of 4
11. (unload hoist1 crate1 truck0 depot1)
   deleted: (available hoist1) (in crate1 truck0)
   added: (lifting hoist1 crate1)
   goals met: 0 of 4
12. (lift hoist3 crate4 pallet3 distributor0)
   deleted: (at crate4 distributor0) (available hoist3) (on crate4 pallet3) (clear crate4)
   added: (lifting hoist3 crate4) (clear pallet3)
   goals met: 0 of 4
13. (load hoist3 crate4 truck1 distributor0)
   deleted: (lifting hoist3 crate4)
   added: (in crate4 truck1) (available hoist3)
   goals met: 0 of 4
14. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   goals met: 0 of 4
15. (unload hoist3 crate3 truck0 distributor0)
   deleted: (available hoist3) (in crate3 truck0)
   added: (lifting hoist3 crate3)
   goals met: 0 of 4
16. (drop hoist1 crate1 pallet1 depot1)
   deleted: (lifting hoist1 crate1) (clear pallet1)
   added: (at crate1 depot1) (available hoist1) (on crate1 pallet1) (clear crate1)
   goals met: 1 of 4
17. (drop hoist3 crate3 pallet3 distributor0)
   deleted: (lifting hoist3 crate3) (clear pallet3)
   added: (at crate3 distributor0) (available hoist3) (on crate3 pallet3) (clear crate3)
   goals met: 2 of 4
18. (unload hoist3 crate4 truck1 distributor0)
   deleted: (available hoist3) (in crate4 truck1)
   added: (lifting hoist3 crate4)
   goals met: 2 of 4
19. (drop hoist3 crate4 crate3 distributor0)
   deleted: (lifting hoist3 crate4) (clear crate3)
   added: (at crate4 distributor0) (available hoist3) (on crate4 crate3) (clear crate4)
   goals met: 3 of 4
20. (unload hoist3 crate0 truck0 distributor0)
   deleted: (available hoist3) (in crate0 truck0)
   added: (lifting hoist3 crate0)
   goals met: 3 of 4
21. (drop hoist3 crate0 crate4 distributor0)
   deleted: (lifting hoist3 crate0) (clear crate4)
   added: (at crate0 distributor0) (available hoist3) (on crate0 crate4) (clear crate0)
   goals met: 4 of 4
